[
    {
        "name": "Битва під Крутами",
        "year": 1918,
        "latitude": 50.2500,
        "longitude": 31.5667,
        "info": "Бій між українськими студентами та більшовицькими військами, що відбувся поблизу станції Крути під час Української революції."
    },
    {
        "name": "Битва за Дніпро",
        "year": 1943,
        "latitude": 49.9935,
        "longitude": 31.2497,
        "info": "Ключова битва під час Другої світової війни, коли радянські війська переправилися через Дніпро та звільнили правобережну Україну від нацистських військ."
    },
    {
        "name": "Битва за Київ (1943)",
        "year": 1943,
        "latitude": 50.4501,
        "longitude": 30.5236,
        "info": "Операція з оточення та знищення німецьких військ у Київській області, що призвела до звільнення столиці України."
    },
    {
        "name": "Битва під Харковом (1943)",
        "year": 1943,
        "latitude": 49.9935,
        "longitude": 36.2304,
        "info": "Велика танкова битва між радянськими та німецькими військами поблизу Харкова під час Другої світової війни."
    },
    {
        "name": "Битва за Севастополь",
        "year": 1941,
        "latitude": 44.6167,
        "longitude": 33.5256,
        "info": "Оборона міста Севастополь від нацистських військ, що тривала 250 днів і була однією з найдовших морських оборон у історії."
    },
    {
        "name": "Битва під Черкасами (1943)",
        "year": 1943,
        "latitude": 49.4444,
        "longitude": 32.0597,
        "info": "Бої між радянськими та німецькими військами за контроль над Черкаською областю під час Другої світової війни."
    },
    {
        "name": "Битва за Одесу",
        "year": 1941,
        "latitude": 46.4825,
        "longitude": 30.7326,
        "info": "Оборона міста Одеса від нацистських військ, яка тривала 73 дні та була частиною південного фронту СРСР."
    },
    {
        "name": "Битва під Луцьком (1941)",
        "year": 1941,
        "latitude": 50.7500,
        "longitude": 25.3444,
        "info": "Бої між радянськими та німецькими військами за контроль над містом Луцьк на початку німецько-радянської війни."
    },
    {
        "name": "Битва за Донецький аеропорт",
        "year": 2014,
        "latitude": 48.2922,
        "longitude": 37.8044,
        "info": "Тривалі бої між українськими військами та проросійськими сепаратистами за контроль над аеропортом Донецька під час війни на сході України."
    },
    {
        "name": "Битва за Маріуполь (2014)",
        "year": 2014,
        "latitude": 47.1000,
        "longitude": 37.5500,
        "info": "Конфлікт між українськими військами та проросійськими силами за контроль над містом Маріуполь на сході України."
    },
    {
        "name": "Битва під Лінією Сталіна (1941)",
        "year": 1941,
        "latitude": 48.8450,
        "longitude": 31.0330,
        "info": "Битва в межах Сталінської лінії оборони між радянськими та німецькими військами під час наступу на Україну в 1941 році."
    },
    {
        "name": "Битва під Гомелем (1943)",
        "year": 1943,
        "latitude": 50.9875,
        "longitude": 31.4306,
        "info": "Частина боїв за знищення нацистських військ у центральній Україні під час визвольної кампанії 1943 року."
    },
    {
        "name": "Битва за Луганськ (2014)",
        "year": 2014,
        "latitude": 48.5743,
        "longitude": 39.3143,
        "info": "Бої за Луганськ між українськими військами та проросійськими сепаратистами влітку 2014 року, що стали частиною війни на сході України."
    },
    {
        "name": "Битва під Іловайськом",
        "year": 2014,
        "latitude": 48.1467,
        "longitude": 38.5925,
        "info": "Один із найкривавіших етапів війни на сході України, коли українські війська потрапили в оточення під Іловайськом у серпні 2014 року."
    }
]
